rust-for-rustaceans-6/index.org
#+OPTIONS: num:nil toc:nil
#+OPTIONS: timestamp:nil
#+REVEAL_THEME: night
#+REVEAL_EXTRA_CSS: ./style.css
#+Title: Chapter 6
#+Date: 2024-05-15
#+Author: Tim Heaney
#+Email: oylenshpeegul@pm.me

* Agenda
** Testing
- Review
- [[https://rust-for-rustaceans.com/][Rust for Rustaceans]]

* Review

** [[https://doc.rust-lang.org/stable/book/][The Rust Programming Language]]
- chapter 11: [[https://doc.rust-lang.org/stable/book/ch11-00-testing.html][Writing Automated Tests]]
- [[https://www.youtube.com/watch?v=8A3oCwtenuY&list=PL8AZrEE2-qZkcOFmpC03TwnVHSr25luFp&index=5][Rust Book Study Session]] video
  - 2021-12-15
  - lead by Krzysztof

** Rust testing
1. Unit testing
2. Doc testing
3. Integration testing
4. Benchmark testing

** Cargo generates "hello world" for a binary
#+begin_src bash
❯ cargo new hello
     Creating binary (application) `hello` package

#+end_src

** ~hello/src/main.rs~
#+begin_src rust
fn main() {
    println!("Hello, world!");
}
#+end_src

** ~cargo run~
#+begin_src bash
❯ cd hello
❯ cargo run
   Compiling hello v0.1.0 (/home/tim/tmp/hello)
    Finished `dev` profile [unoptimized + debuginfo] target(s) in 0.18s
     Running `/home/tim/rust/target/debug/hello`
Hello, world!

#+end_src

** Cargo generates a test for a library
#+begin_src bash
❯ cargo new adder --lib
     Creating library `adder` package

#+end_src

** ~adder/src/lib.rs~

#+begin_src rust
pub fn add(left: usize, right: usize) -> usize {
    left + right
}

#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    fn it_works() {
        let result = add(2, 2);
        assert_eq!(result, 4);
    }
}
#+end_src

** ~cargo test~
#+begin_src bash
❯ cd adder
❯ cargo test
    Finished `test` profile [unoptimized + debuginfo] target(s) in 0.00s
     Running unittests src/lib.rs (/home/tim/rust/target/debug/deps/adder-8c81ce131dde6a16)

running 1 test
test tests::it_works ... ok

test result: ok. 1 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

   Doc-tests adder

running 0 tests

test result: ok. 0 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

#+end_src

** Macros
#+ATTR_REVEAL: :frag (appear)
- ~#[test]~, ~#[cfg(test)]~
- ~assert!~, ~assert_eq!~, &c.
- ~#[ignore]~, ~#[should_panic]~, &c.

** Rust 1.78 stabilized [[https://blog.rust-lang.org/2024/05/02/Rust-1.78.0.html#diagnostic-attributes][diagnostic attributes]]
~#[diagnostic]~

** Unstable Rust has a [[https://doc.rust-lang.org/nightly/unstable-book/library-features/test.html][bench attribute]]
~#[bench]~

** [[https://exercism.org/][exercism.org]]
- Programming exercises
- Test-based
- Has [[https://exercism.org/tracks/rust][a Rust track]]
- ~cargo test -- --include-ignored~

* [[https://rust-for-rustaceans.com/][Rust for Rustaceans]]
  
** 6. Testing
- Rust Testing Mechanisms
- Additional Testing Tools
- Summary
  
** Rust Testing Mechanisms
  - The Test Harness
  - ~#[cfg(test)]~
  - Test-Only APIs
  - Bookkeeping for Test Assertions
  - Doctests

** Additional Testing Tools
  - Linting
  - Test Generation
    - Fuzzing
    - Property-based testing
  - Test Augmentation
  - Performance Testing
    - Performance Variance
    - Compiler Optimizations
    - I/O Overhead Measurement

** Summary

* Rust Testing Mechanisms

** The Test Harness

** look at adder again
#+begin_src rust
pub fn add(left: usize, right: usize) -> usize {
    left + right
}

#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    fn it_works() {
        let result = add(2, 2);
        assert_eq!(result, 4);
    }
}
#+end_src

** ~cargo expand~
#+begin_src rust
#![feature(prelude_import)]
#[prelude_import]
use std::prelude::rust_2021::*;
#[macro_use]
extern crate std;
pub fn add(left: usize, right: usize) -> usize {
    left + right
}
#+end_src

