rust-for-rustaceans-6/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Chapter 6</title>
<meta name="author" content="Tim Heaney"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="../dist/reveal.css"/>

<link rel="stylesheet" href="../dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="./style.css"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Chapter 6</h1><p class="subtitle"></p>
<h2 class="author">Tim Heaney</h2><h2 class="date">2024-05-15</h2>
</section>

<section>
<section id="slide-org1f8ede7">
<h2 id="org1f8ede7">Agenda</h2>
<div class="outline-text-2" id="text-org1f8ede7">
</div>
</section>
<section id="slide-org7bc56da">
<h3 id="org7bc56da">Testing</h3>
<ul>
<li>Review</li>
<li><a href="https://rust-for-rustaceans.com/">Rust for Rustaceans</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-org091f204">
<h2 id="org091f204">Review</h2>
<div class="outline-text-2" id="text-org091f204">
</div>
</section>
<section id="slide-org00641ce">
<h3 id="org00641ce"><a href="https://doc.rust-lang.org/stable/book/">The Rust Programming Language</a></h3>
<ul>
<li>chapter 11: <a href="https://doc.rust-lang.org/stable/book/ch11-00-testing.html">Writing Automated Tests</a></li>
<li><a href="https://www.youtube.com/watch?v=8A3oCwtenuY&amp;list=PL8AZrEE2-qZkcOFmpC03TwnVHSr25luFp&amp;index=5">Rust Book Study Session</a> video
<ul>
<li>2021-12-15</li>
<li>lead by Krzysztof</li>

</ul></li>

</ul>

</section>
<section id="slide-org2d55c34">
<h3 id="org2d55c34">Rust testing</h3>
<ol>
<li>Unit testing</li>
<li>Doc testing</li>
<li>Integration testing</li>
<li>Benchmark testing</li>

</ol>

</section>
<section id="slide-orgb15d298">
<h3 id="orgb15d298">Cargo generates "hello world" for a binary</h3>
<div class="org-src-container">

<pre  class="src src-bash"   ><code trim>&#10095; cargo new hello
     Creating binary <span style="color: #ffffff;">(</span>application<span style="color: #ffffff;">)</span> <span style="color: #f78fe7;">`hello`</span> package

</code></pre>
</div>

</section>
<section id="slide-orge609b03">
<h3 id="orge609b03"><code>hello/src/main.rs</code></h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
    <span style="color: #f78fe7;">println!</span><span style="color: #ff62d4;">(</span><span style="color: #79a8ff;">"Hello, world!"</span><span style="color: #ff62d4;">)</span>;
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orgf969e66">
<h3 id="orgf969e66"><code>cargo run</code></h3>
<div class="org-src-container">

<pre  class="src src-bash"   ><code trim>&#10095; cd hello
&#10095; cargo run
   Compiling hello v0.1.0 <span style="color: #ffffff;">(</span>/home/tim/tmp/hello<span style="color: #ffffff;">)</span>
    Finished <span style="color: #f78fe7;">`dev`</span> profile <span style="color: #ffffff;">[</span>unoptimized + debuginfo<span style="color: #ffffff;">]</span> target<span style="color: #ffffff;">(</span>s<span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">in</span> 0.18s
     Running <span style="color: #f78fe7;">`/home/tim/rust/target/debug/hello`</span>
Hello, world!

</code></pre>
</div>

</section>
<section id="slide-org795a259">
<h3 id="org795a259">Cargo generates a test for a library</h3>
<div class="org-src-container">

<pre  class="src src-bash"   ><code trim>&#10095; cargo new adder --lib
     Creating library <span style="color: #f78fe7;">`adder`</span> package

</code></pre>
</div>

</section>
<section id="slide-org5a1c07f">
<h3 id="org5a1c07f"><code>adder/src/lib.rs</code></h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">add</span><span style="color: #ffffff;">(</span><span style="color: #00d3d0;">left</span>: <span style="color: #6ae4b9;">usize</span>, <span style="color: #00d3d0;">right</span>: <span style="color: #6ae4b9;">usize</span><span style="color: #ffffff;">)</span> -&gt; <span style="color: #6ae4b9;">usize</span> <span style="color: #ffffff;">{</span>
    left + right
<span style="color: #ffffff;">}</span>

<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #ff62d4;">(</span><span style="color: #ff9077;">test</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">mod</span> <span style="color: #00bcff;">tests</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">use</span> <span style="color: #b6a0ff;">super</span>::*;

    <span style="color: #ff9077;">#</span><span style="color: #ff62d4;">[</span><span style="color: #ff9077;">test</span><span style="color: #ff62d4;">]</span>
    <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">it_works</span><span style="color: #ff62d4;">()</span> <span style="color: #ff62d4;">{</span>
        <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">result</span> = add<span style="color: #3fdfd0;">(</span>2, 2<span style="color: #3fdfd0;">)</span>;
        <span style="color: #ff9077;">assert_eq!</span><span style="color: #3fdfd0;">(</span>result, 4<span style="color: #3fdfd0;">)</span>;
    <span style="color: #ff62d4;">}</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org25afe41">
<h3 id="org25afe41"><code>cargo test</code></h3>
<div class="org-src-container">

<pre  class="src src-bash"   ><code trim>&#10095; cd adder
&#10095; cargo test
    Finished <span style="color: #f78fe7;">`test`</span> profile <span style="color: #ffffff;">[</span>unoptimized + debuginfo<span style="color: #ffffff;">]</span> target<span style="color: #ffffff;">(</span>s<span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">in</span> 0.00s
     Running unittests src/lib.rs <span style="color: #ffffff;">(</span>/home/tim/rust/target/debug/deps/adder-8c81ce131dde6a16<span style="color: #ffffff;">)</span>

running 1 test
<span style="color: #f78fe7;">test</span> tests::it_works ... ok

<span style="color: #f78fe7;">test</span> result: ok. 1 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out; finished<span style="color: #b6a0ff;"> in</span> 0.00s

   Doc-tests adder

running 0 tests

<span style="color: #f78fe7;">test</span> result: ok. 0 passed; 0 failed; 0 ignored; 0 measured; 0 filtered out; finished<span style="color: #b6a0ff;"> in</span> 0.00s

</code></pre>
</div>

</section>
<section id="slide-org6ea9d13">
<h3 id="org6ea9d13">Macros</h3>
<ul>
<li class="fragment appear"><code>#[test]</code>, <code>#[cfg(test)]</code></li>
<li class="fragment appear"><code>assert!</code>, <code>assert_eq!</code>, &amp;c.</li>
<li class="fragment appear"><code>#[ignore]</code>, <code>#[should_panic]</code>, &amp;c.</li>

</ul>

</section>
<section id="slide-org907553b">
<h3 id="org907553b">Rust 1.78 stabilized <a href="https://blog.rust-lang.org/2024/05/02/Rust-1.78.0.html#diagnostic-attributes">diagnostic attributes</a></h3>
<p>
<code>#[diagnostic]</code>
</p>

</section>
<section id="slide-org2b2be5c">
<h3 id="org2b2be5c">Unstable Rust has a <a href="https://doc.rust-lang.org/nightly/unstable-book/library-features/test.html">bench attribute</a></h3>
<p>
<code>#[bench]</code>
</p>

</section>
<section id="slide-orgcf1d51a">
<h3 id="orgcf1d51a"><a href="https://exercism.org/">exercism.org</a></h3>
<ul>
<li>Programming exercises</li>
<li>Test-based</li>
<li>Has <a href="https://exercism.org/tracks/rust">a Rust track</a></li>
<li><code>cargo test -- --include-ignored</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-org2b15025">
<h2 id="org2b15025"><a href="https://rust-for-rustaceans.com/">Rust for Rustaceans</a></h2>
<div class="outline-text-2" id="text-org2b15025">
</div>
</section>
<section id="slide-orgda9272d">
<h3 id="orgda9272d">6. Testing</h3>
<ul>
<li>Rust Testing Mechanisms</li>
<li>Additional Testing Tools</li>
<li>Summary</li>

</ul>

</section>
<section id="slide-orgffe7201">
<h3 id="orgffe7201">Rust Testing Mechanisms</h3>
<ul>
<li>The Test Harness</li>
<li><code>#[cfg(test)]</code></li>
<li>Test-Only APIs</li>
<li>Bookkeeping for Test Assertions</li>
<li>Doctests</li>

</ul>

</section>
<section id="slide-org2aab799">
<h3 id="org2aab799">Additional Testing Tools</h3>
<ul>
<li>Linting</li>
<li>Test Generation
<ul>
<li>Fuzzing</li>
<li>Property-based testing</li>

</ul></li>
<li>Test Augmentation</li>
<li>Performance Testing
<ul>
<li>Performance Variance</li>
<li>Compiler Optimizations</li>
<li>I/O Overhead Measurement</li>

</ul></li>

</ul>

</section>
<section id="slide-orga8c5913">
<h3 id="orga8c5913">Summary</h3>

</section>
</section>
<section>
<section id="slide-org4ab0b20">
<h2 id="org4ab0b20">Rust Testing Mechanisms</h2>
<div class="outline-text-2" id="text-org4ab0b20">
</div>
</section>
<section id="slide-org37b80cc">
<h3 id="org37b80cc">The Test Harness</h3>

</section>
<section id="slide-org1cdf38a">
<h3 id="org1cdf38a">look at adder again</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">add</span><span style="color: #ffffff;">(</span><span style="color: #00d3d0;">left</span>: <span style="color: #6ae4b9;">usize</span>, <span style="color: #00d3d0;">right</span>: <span style="color: #6ae4b9;">usize</span><span style="color: #ffffff;">)</span> -&gt; <span style="color: #6ae4b9;">usize</span> <span style="color: #ffffff;">{</span>
    left + right
<span style="color: #ffffff;">}</span>

<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #ff62d4;">(</span><span style="color: #ff9077;">test</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">mod</span> <span style="color: #00bcff;">tests</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">use</span> <span style="color: #b6a0ff;">super</span>::*;

    <span style="color: #ff9077;">#</span><span style="color: #ff62d4;">[</span><span style="color: #ff9077;">test</span><span style="color: #ff62d4;">]</span>
    <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">it_works</span><span style="color: #ff62d4;">()</span> <span style="color: #ff62d4;">{</span>
        <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">result</span> = add<span style="color: #3fdfd0;">(</span>2, 2<span style="color: #3fdfd0;">)</span>;
        <span style="color: #ff9077;">assert_eq!</span><span style="color: #3fdfd0;">(</span>result, 4<span style="color: #3fdfd0;">)</span>;
    <span style="color: #ff62d4;">}</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
