rust-for-rustaceans-6/index.org
** ~cargo expand --lib --tests~
#+begin_src rust
#![feature(prelude_import)]
#[prelude_import]
use std::prelude::rust_2021::*;
#[macro_use]
extern crate std;
pub fn add(left: usize, right: usize) -> usize {
    left + right
}
#[cfg(test)]
mod tests {
    use super::*;
    extern crate test;
    #[cfg(test)]
    #[rustc_test_marker = "tests::it_works"]
    pub const it_works: test::TestDescAndFn = test::TestDescAndFn {
        desc: test::TestDesc {
            name: test::StaticTestName("tests::it_works"),
            ignore: false,
            ignore_message: ::core::option::Option::None,
            source_file: "src/lib.rs",
            start_line: 10usize,
            start_col: 8usize,
            end_line: 10usize,
            end_col: 16usize,
            compile_fail: false,
            no_run: false,
            should_panic: test::ShouldPanic::No,
            test_type: test::TestType::UnitTest,
        },
        testfn: test::StaticTestFn(
            #[coverage(off)]
            || test::assert_test_result(it_works()),
        ),
    };
    fn it_works() {
        let result = add(2, 2);
        match (&result, &4) {
            (left_val, right_val) => {
                if !(*left_val == *right_val) {
                    let kind = ::core::panicking::AssertKind::Eq;
                    ::core::panicking::assert_failed(
                        kind,
                        &*left_val,
                        &*right_val,
                        ::core::option::Option::None,
                    );
                }
            }
        };
    }
}
#[rustc_main]
#[coverage(off)]
pub fn main() -> () {
    extern crate test;
    test::test_main_static(&[&it_works])
}
#+end_src

** The Test Harness
- the default test harness (libtest)
- can write our own test harness

** in Cargo.toml  
#+begin_src toml
[[test]]
name = "custom"
path = "tests/custom.rs"
harness = false
#+end_src

** Arguments to the default test harness
- ~--help~
- ~--nocapture~
- ~--test-threads~
- Will have to implement these as well  

** Why use a custom (or no) test harness
- benchmarks
- fuzzers
- model checkers
- custom global set-up (/e.g./, WebAssembly)
  
** ~#[cfg(test)]~
- compilation context
- Caira mentioned last time in Chapter 5
- compiler configuration flag /test/
- ~rustc --test~
  
** Mocking
- mocks and fakes
  - database connections
  - network connections
- generics
- dedicated struct
  - ~#[cfg(test)]~
  - ~#[cfg(feature = "test_mock_foo")]~

** [[https://www.youtube.com/watch?v=B81U7Vunhuc][Mocking]]
- no standard approach yet
- [[https://crates.io/crates/mockall][mockall]] crate

** Test-Only APIs
- First, code that's only for testing
  
