rust-for-rustaceans-6/index.html
<section id="slide-orga8a975b">
<h3 id="orga8a975b"><code>cargo expand</code></h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #ff9077;">#!</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">feature</span><span style="color: #ff62d4;">(</span><span style="color: #ff9077;">prelude_import</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">]</span>
<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">prelude_import</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">use</span> <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">prelude</span>::<span style="color: #00bcff;">rust_2021</span>::*;
<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">macro_use</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">extern</span> <span style="color: #b6a0ff;">crate</span> std;
<span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">add</span><span style="color: #ffffff;">(</span><span style="color: #00d3d0;">left</span>: <span style="color: #6ae4b9;">usize</span>, <span style="color: #00d3d0;">right</span>: <span style="color: #6ae4b9;">usize</span><span style="color: #ffffff;">)</span> -&gt; <span style="color: #6ae4b9;">usize</span> <span style="color: #ffffff;">{</span>
    left + right
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orga3fb647">
<h3 id="orga3fb647"><code>cargo expand --lib --tests</code></h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #ff9077;">#!</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">feature</span><span style="color: #ff62d4;">(</span><span style="color: #ff9077;">prelude_import</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">]</span>
<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">prelude_import</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">use</span> <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">prelude</span>::<span style="color: #00bcff;">rust_2021</span>::*;
<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">macro_use</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">extern</span> <span style="color: #b6a0ff;">crate</span> std;
<span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">add</span><span style="color: #ffffff;">(</span><span style="color: #00d3d0;">left</span>: <span style="color: #6ae4b9;">usize</span>, <span style="color: #00d3d0;">right</span>: <span style="color: #6ae4b9;">usize</span><span style="color: #ffffff;">)</span> -&gt; <span style="color: #6ae4b9;">usize</span> <span style="color: #ffffff;">{</span>
    left + right
<span style="color: #ffffff;">}</span>
<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #ff62d4;">(</span><span style="color: #ff9077;">test</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">mod</span> <span style="color: #00bcff;">tests</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">use</span> <span style="color: #b6a0ff;">super</span>::*;
    <span style="color: #b6a0ff;">extern</span> <span style="color: #b6a0ff;">crate</span> test;
    <span style="color: #ff9077;">#</span><span style="color: #ff62d4;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #3fdfd0;">(</span><span style="color: #ff9077;">test</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">]</span>
    <span style="color: #ff9077;">#</span><span style="color: #ff62d4;">[</span><span style="color: #ff9077;">rustc_test_marker = </span><span style="color: #79a8ff;">"tests::it_works"</span><span style="color: #ff62d4;">]</span>
    <span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">const</span> <span style="color: #00d3d0;">it_works</span>: <span style="color: #00bcff;">test</span>::<span style="color: #6ae4b9;">TestDescAndFn</span> = <span style="color: #00bcff;">test</span>::<span style="color: #6ae4b9;">TestDescAndFn</span> <span style="color: #ff62d4;">{</span>
        <span style="color: #00d3d0;">desc</span>: <span style="color: #00bcff;">test</span>::<span style="color: #6ae4b9;">TestDesc</span> <span style="color: #3fdfd0;">{</span>
            <span style="color: #00d3d0;">name</span>: <span style="color: #00bcff;">test</span>::<span style="color: #6ae4b9;">StaticTestName</span><span style="color: #fba849;">(</span><span style="color: #79a8ff;">"tests::it_works"</span><span style="color: #fba849;">)</span>,
            <span style="color: #00d3d0;">ignore</span>: <span style="color: #b6a0ff;">false</span>,
            <span style="color: #00d3d0;">ignore_message</span>: ::<span style="color: #00bcff;">core</span>::<span style="color: #00bcff;">option</span>::<span style="color: #6ae4b9;">Option</span>::<span style="color: #6ae4b9;">None</span>,
            <span style="color: #00d3d0;">source_file</span>: <span style="color: #79a8ff;">"src/lib.rs"</span>,
            <span style="color: #00d3d0;">start_line</span>: 10<span style="color: #6ae4b9;">usize</span>,
            <span style="color: #00d3d0;">start_col</span>: 8<span style="color: #6ae4b9;">usize</span>,
            <span style="color: #00d3d0;">end_line</span>: 10<span style="color: #6ae4b9;">usize</span>,
            <span style="color: #00d3d0;">end_col</span>: 16<span style="color: #6ae4b9;">usize</span>,
            <span style="color: #00d3d0;">compile_fail</span>: <span style="color: #b6a0ff;">false</span>,
            <span style="color: #00d3d0;">no_run</span>: <span style="color: #b6a0ff;">false</span>,
            <span style="color: #00d3d0;">should_panic</span>: <span style="color: #00bcff;">test</span>::<span style="color: #6ae4b9;">ShouldPanic</span>::<span style="color: #6ae4b9;">No</span>,
            <span style="color: #00d3d0;">test_type</span>: <span style="color: #00bcff;">test</span>::<span style="color: #6ae4b9;">TestType</span>::<span style="color: #6ae4b9;">UnitTest</span>,
        <span style="color: #3fdfd0;">}</span>,
        <span style="color: #00d3d0;">testfn</span>: <span style="color: #00bcff;">test</span>::<span style="color: #6ae4b9;">StaticTestFn</span><span style="color: #3fdfd0;">(</span>
            <span style="color: #ff9077;">#</span><span style="color: #fba849;">[</span><span style="color: #ff9077;">coverage</span><span style="color: #9f80ff;">(</span><span style="color: #ff9077;">off</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">]</span>
            || <span style="color: #00bcff;">test</span>::assert_test_result<span style="color: #fba849;">(</span>it_works<span style="color: #9f80ff;">()</span><span style="color: #fba849;">)</span>,
        <span style="color: #3fdfd0;">)</span>,
    <span style="color: #ff62d4;">}</span>;
    <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">it_works</span><span style="color: #ff62d4;">()</span> <span style="color: #ff62d4;">{</span>
        <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">result</span> = add<span style="color: #3fdfd0;">(</span>2, 2<span style="color: #3fdfd0;">)</span>;
        <span style="color: #b6a0ff;">match</span> <span style="color: #3fdfd0;">(</span><span style="color: #ffffff; background-color: #000000;">&amp;</span>result, <span style="color: #ffffff; background-color: #000000;">&amp;</span>4<span style="color: #3fdfd0;">)</span> <span style="color: #3fdfd0;">{</span>
            <span style="color: #fba849;">(</span>left_val, right_val<span style="color: #fba849;">)</span> =&gt; <span style="color: #fba849;">{</span>
                <span style="color: #b6a0ff;">if</span> !<span style="color: #9f80ff;">(</span>*left_val == *right_val<span style="color: #9f80ff;">)</span> <span style="color: #9f80ff;">{</span>
                    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">kind</span> = ::<span style="color: #00bcff;">core</span>::<span style="color: #00bcff;">panicking</span>::<span style="color: #6ae4b9;">AssertKind</span>::<span style="color: #6ae4b9;">Eq</span>;
                    ::<span style="color: #00bcff;">core</span>::<span style="color: #00bcff;">panicking</span>::assert_failed<span style="color: #4fe42f;">(</span>
                        kind,
                        <span style="color: #ffffff; background-color: #000000;">&amp;</span>*left_val,
                        <span style="color: #ffffff; background-color: #000000;">&amp;</span>*right_val,
                        ::<span style="color: #00bcff;">core</span>::<span style="color: #00bcff;">option</span>::<span style="color: #6ae4b9;">Option</span>::<span style="color: #6ae4b9;">None</span>,
                    <span style="color: #4fe42f;">)</span>;
                <span style="color: #9f80ff;">}</span>
            <span style="color: #fba849;">}</span>
        <span style="color: #3fdfd0;">}</span>;
    <span style="color: #ff62d4;">}</span>
<span style="color: #ffffff;">}</span>
<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">rustc_main</span><span style="color: #ffffff;">]</span>
<span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">coverage</span><span style="color: #ff62d4;">(</span><span style="color: #ff9077;">off</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">()</span> -&gt; <span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">extern</span> <span style="color: #b6a0ff;">crate</span> test;
    <span style="color: #00bcff;">test</span>::test_main_static<span style="color: #ff62d4;">(</span><span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #3fdfd0;">[</span><span style="color: #ffffff; background-color: #000000;">&amp;</span>it_works<span style="color: #3fdfd0;">]</span><span style="color: #ff62d4;">)</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org57dac37">
<h3 id="org57dac37">The Test Harness</h3>
<ul>
<li>the default test harness (libtest)</li>
<li>can write our own test harness</li>

</ul>

</section>
<section id="slide-org4c4021a">
<h3 id="org4c4021a">in Cargo.toml</h3>
<div class="org-src-container">

<pre  class="src src-toml"   ><code trim>[[<span style="color: #6ae4b9;">test</span>]]
<span style="color: #00d3d0;">name</span> = <span style="color: #79a8ff;">"custom"</span>
<span style="color: #00d3d0;">path</span> = <span style="color: #79a8ff;">"tests/custom.rs"</span>
<span style="color: #00d3d0;">harness</span> = <span style="color: #b6a0ff;">false</span>
</code></pre>
</div>

</section>
<section id="slide-org09bc9df">
<h3 id="org09bc9df">Arguments to the default test harness</h3>
<ul>
<li><code>--help</code></li>
<li><code>--nocapture</code></li>
<li><code>--test-threads</code></li>
<li>Will have to implement these as well</li>

</ul>

</section>
<section id="slide-org9af47fe">
<h3 id="org9af47fe">Why use a custom (or no) test harness</h3>
<ul>
<li>benchmarks</li>
<li>fuzzers</li>
<li>model checkers</li>
<li>custom global set-up (<i>e.g.</i>, WebAssembly)</li>

</ul>

</section>
<section id="slide-org06c59c4">
<h3 id="org06c59c4"><code>#[cfg(test)]</code></h3>
<ul>
<li>compilation context</li>
<li>Caira mentioned last time in Chapter 5</li>
<li>compiler configuration flag <i>test</i></li>
<li><code>rustc --test</code></li>

</ul>

</section>
<section id="slide-org01f0ae6">
<h3 id="org01f0ae6">Mocking</h3>
<ul>
<li>mocks and fakes
<ul>
<li>database connections</li>
<li>network connections</li>

</ul></li>
<li>generics</li>
<li>dedicated struct
<ul>
<li><code>#[cfg(test)]</code></li>
<li><code>#[cfg(feature = "test_mock_foo")]</code></li>

</ul></li>

</ul>

</section>
<section id="slide-orgf753fab">
<h3 id="orgf753fab"><a href="https://www.youtube.com/watch?v=B81U7Vunhuc">Mocking</a></h3>
<ul>
<li>no standard approach yet</li>
<li><a href="https://crates.io/crates/mockall">mockall</a> crate</li>

</ul>

</section>
<section id="slide-orgb5918c4">
<h3 id="orgb5918c4">Test-Only APIs</h3>
<ul>
<li>First, code that's only for testing</li>

</ul>

</section>
