rust-for-rustaceans-6/index.org
** testing the hashbrown crate
#+begin_src rust
#[test]
fn insert_just_one() {
    let mut m = HashMap::new();
    m.insert(42, ());
    let full = m.table.buckets.iter().filter(Bucket::is_full).count();
    assert_eq!(full, 1);
}
#+end_src

** Private fields
- We are testing in ~HashMap~
- So we can see ~m.table~ even though it's private
- But ~RawTable~ is in another module
- So we cannot see ~m.table.buckets~

** Create an accessor just for testing

#+begin_src rust
impl RawTable {
    #[cfg(test)]
    pub(crate) fn buckets(&self) -> &[Bucket] {
        &self.buckets
    }
}
#+end_src

** Change test to call method
#+begin_src rust
#[test]
fn insert_just_one() {
    let mut m = HashMap::new();
    m.insert(42, ());
    let full = m.table.buckets().iter().filter(Bucket::is_full).count();
    assert_eq!(full, 1);
}
#+end_src

** Bookkeeping for Test Assertions
- Second, data that's only for testing

** keep track of writes
#+begin_src rust
struct BufWriter<T> {
    #[cfg(test)]
    write_through: usize,
    // other fields ...
}
#+end_src

** keep track of writes
#+begin_src rust
struct BufWriter<T> {
    #[cfg(test)]
    write_through: usize,
    // other fields ...
}

impl<T: Write> Write for BufWriter<T> {
    fn write(&mut self, buf: &[u8]) -> Result<usize> {
        // ...
        if self.full() {
            #[cfg(test)]
            self.write_through += 1;
            let n = self.inner.write(&self.buffer[..])?;
        }
    }
}
#+end_src

** Doctests
  
** Docstring for function

#+begin_src rust
/// Completely frobnifies a number through I/O.
///
pub fn frobnify(i: usize) -> std::io::Result<()> {
    if i == 0 {
        return Ok(());
    }
    Err(std::io::Error::new(std::io::ErrorKind::Other, "error"))
}
#+end_src

  
** Add Doctests

#+begin_src rust
/// Completely frobnifies a number through I/O.
///
/// ```
/// # use mylib::frobnify;
/// # let unfrobnified_number = 0;
/// # let already_frobnified = 1;
/// assert!(frobnify(unfrobnified_number).is_ok());
/// assert!(frobnify(already_frobnified).is_err());
/// ```
pub fn frobnify(i: usize) -> std::io::Result<()> {
    if i == 0 {
        return Ok(());
    }
    Err(std::io::Error::new(std::io::ErrorKind::Other, "error"))
}
#+end_src

