rust-for-rustaceans-6/index.html
<section id="slide-orgfc3b031">
<h3 id="orgfc3b031">testing the hashbrown crate</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">test</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">insert_just_one</span><span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">m</span> = <span style="color: #6ae4b9;">HashMap</span>::new<span style="color: #ff62d4;">()</span>;
    m.insert<span style="color: #ff62d4;">(</span>42, <span style="color: #3fdfd0;">()</span><span style="color: #ff62d4;">)</span>;
    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">full</span> = m.table.buckets.iter<span style="color: #ff62d4;">()</span>.filter<span style="color: #ff62d4;">(</span><span style="color: #6ae4b9;">Bucket</span>::is_full<span style="color: #ff62d4;">)</span>.count<span style="color: #ff62d4;">()</span>;
    <span style="color: #ff9077;">assert_eq!</span><span style="color: #ff62d4;">(</span>full, 1<span style="color: #ff62d4;">)</span>;
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org0cc9cbb">
<h3 id="org0cc9cbb">Private fields</h3>
<ul>
<li>We are testing in <code>HashMap</code></li>
<li>So we can see <code>m.table</code> even though it's private</li>
<li>But <code>RawTable</code> is in another module</li>
<li>So we cannot see <code>m.table.buckets</code></li>

</ul>

</section>
<section id="slide-org0bc1ac2">
<h3 id="org0bc1ac2">Create an accessor just for testing</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">impl</span> <span style="color: #6ae4b9;">RawTable</span> <span style="color: #ffffff;">{</span>
    <span style="color: #ff9077;">#</span><span style="color: #ff62d4;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #3fdfd0;">(</span><span style="color: #ff9077;">test</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">]</span>
    <span style="color: #b6a0ff;">pub</span><span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">crate</span><span style="color: #ff62d4;">)</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">buckets</span><span style="color: #ff62d4;">(</span><span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #b6a0ff;">self</span><span style="color: #ff62d4;">)</span> -&gt; <span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #ff62d4;">[</span><span style="color: #6ae4b9;">Bucket</span><span style="color: #ff62d4;">]</span> <span style="color: #ff62d4;">{</span>
        <span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #b6a0ff;">self</span>.buckets
    <span style="color: #ff62d4;">}</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org93bbe6a">
<h3 id="org93bbe6a">Change test to call method</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #ff9077;">#</span><span style="color: #ffffff;">[</span><span style="color: #ff9077;">test</span><span style="color: #ffffff;">]</span>
<span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">insert_just_one</span><span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">m</span> = <span style="color: #6ae4b9;">HashMap</span>::new<span style="color: #ff62d4;">()</span>;
    m.insert<span style="color: #ff62d4;">(</span>42, <span style="color: #3fdfd0;">()</span><span style="color: #ff62d4;">)</span>;
    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">full</span> = m.table.buckets<span style="color: #ff62d4;">()</span>.iter<span style="color: #ff62d4;">()</span>.filter<span style="color: #ff62d4;">(</span><span style="color: #6ae4b9;">Bucket</span>::is_full<span style="color: #ff62d4;">)</span>.count<span style="color: #ff62d4;">()</span>;
    <span style="color: #ff9077;">assert_eq!</span><span style="color: #ff62d4;">(</span>full, 1<span style="color: #ff62d4;">)</span>;
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org7c0192c">
<h3 id="org7c0192c">Bookkeeping for Test Assertions</h3>
<ul>
<li>Second, data that's only for testing</li>

</ul>

</section>
<section id="slide-orgfa9d3d6">
<h3 id="orgfa9d3d6">keep track of writes</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">BufWriter</span><span style="color: #ffffff;">&lt;</span><span style="color: #6ae4b9;">T</span><span style="color: #ffffff;">&gt;</span> <span style="color: #ffffff;">{</span>
    <span style="color: #ff9077;">#</span><span style="color: #ff62d4;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #3fdfd0;">(</span><span style="color: #ff9077;">test</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">]</span>
    <span style="color: #00d3d0;">write_through</span>: <span style="color: #6ae4b9;">usize</span>,
    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">other fields ...</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orgd96df70">
<h3 id="orgd96df70">keep track of writes</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">BufWriter</span><span style="color: #ffffff;">&lt;</span><span style="color: #6ae4b9;">T</span><span style="color: #ffffff;">&gt;</span> <span style="color: #ffffff;">{</span>
    <span style="color: #ff9077;">#</span><span style="color: #ff62d4;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #3fdfd0;">(</span><span style="color: #ff9077;">test</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">]</span>
    <span style="color: #00d3d0;">write_through</span>: <span style="color: #6ae4b9;">usize</span>,
    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">other fields ...</span>
<span style="color: #ffffff;">}</span>

<span style="color: #b6a0ff;">impl</span><span style="color: #ffffff;">&lt;</span><span style="color: #00d3d0;">T</span>: <span style="color: #6ae4b9;">Write</span><span style="color: #ffffff;">&gt;</span> <span style="color: #6ae4b9;">Write</span> <span style="color: #b6a0ff;">for</span> <span style="color: #6ae4b9;">BufWriter</span><span style="color: #ffffff;">&lt;</span><span style="color: #6ae4b9;">T</span><span style="color: #ffffff;">&gt;</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">write</span><span style="color: #ff62d4;">(</span><span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #b6a0ff;">mut</span> <span style="color: #b6a0ff;">self</span>, <span style="color: #00d3d0;">buf</span>: <span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #3fdfd0;">[</span><span style="color: #6ae4b9;">u8</span><span style="color: #3fdfd0;">]</span><span style="color: #ff62d4;">)</span> -&gt; <span style="color: #6ae4b9;">Result</span><span style="color: #ff62d4;">&lt;</span><span style="color: #6ae4b9;">usize</span><span style="color: #ff62d4;">&gt;</span> <span style="color: #ff62d4;">{</span>
        <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">...</span>
        <span style="color: #b6a0ff;">if</span> <span style="color: #b6a0ff;">self</span>.full<span style="color: #3fdfd0;">()</span> <span style="color: #3fdfd0;">{</span>
            <span style="color: #ff9077;">#</span><span style="color: #fba849;">[</span><span style="color: #ff9077;">cfg</span><span style="color: #9f80ff;">(</span><span style="color: #ff9077;">test</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">]</span>
            <span style="color: #b6a0ff;">self</span>.write_through += 1;
            <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">n</span> = <span style="color: #b6a0ff;">self</span>.inner.write<span style="color: #fba849;">(</span><span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #b6a0ff;">self</span>.buffer<span style="color: #9f80ff;">[</span>..<span style="color: #9f80ff;">]</span><span style="color: #fba849;">)</span><span style="color: #f78fe7; font-weight: bold;">?</span>;
        <span style="color: #3fdfd0;">}</span>
    <span style="color: #ff62d4;">}</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org60c4645">
<h3 id="org60c4645">Doctests</h3>

</section>
<section id="slide-org590a975">
<h3 id="org590a975">Docstring for function</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b0d6f5;">/// Completely frobnifies a number through I/O.</span>
<span style="color: #b0d6f5;">///</span>
<span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">frobnify</span><span style="color: #ffffff;">(</span><span style="color: #00d3d0;">i</span>: <span style="color: #6ae4b9;">usize</span><span style="color: #ffffff;">)</span> -&gt; <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">Result</span><span style="color: #ffffff;">&lt;</span><span style="color: #ff62d4;">()</span><span style="color: #ffffff;">&gt;</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">if</span> i == 0 <span style="color: #ff62d4;">{</span>
        <span style="color: #b6a0ff;">return</span> <span style="color: #6ae4b9;">Ok</span><span style="color: #3fdfd0;">(</span><span style="color: #fba849;">()</span><span style="color: #3fdfd0;">)</span>;
    <span style="color: #ff62d4;">}</span>
    <span style="color: #6ae4b9;">Err</span><span style="color: #ff62d4;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">Error</span>::new<span style="color: #3fdfd0;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">ErrorKind</span>::<span style="color: #6ae4b9;">Other</span>, <span style="color: #79a8ff;">"error"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>


</section>
<section id="slide-org687018e">
<h3 id="org687018e">Add Doctests</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b0d6f5;">/// Completely frobnifies a number through I/O.</span>
<span style="color: #b0d6f5;">///</span>
<span style="color: #b0d6f5;">/// ```</span>
<span style="color: #b0d6f5;">/// # use mylib::frobnify;</span>
<span style="color: #b0d6f5;">/// # let unfrobnified_number = 0;</span>
<span style="color: #b0d6f5;">/// # let already_frobnified = 1;</span>
<span style="color: #b0d6f5;">/// assert!(frobnify(unfrobnified_number).is_ok());</span>
<span style="color: #b0d6f5;">/// assert!(frobnify(already_frobnified).is_err());</span>
<span style="color: #b0d6f5;">/// ```</span>
<span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">frobnify</span><span style="color: #ffffff;">(</span><span style="color: #00d3d0;">i</span>: <span style="color: #6ae4b9;">usize</span><span style="color: #ffffff;">)</span> -&gt; <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">Result</span><span style="color: #ffffff;">&lt;</span><span style="color: #ff62d4;">()</span><span style="color: #ffffff;">&gt;</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">if</span> i == 0 <span style="color: #ff62d4;">{</span>
        <span style="color: #b6a0ff;">return</span> <span style="color: #6ae4b9;">Ok</span><span style="color: #3fdfd0;">(</span><span style="color: #fba849;">()</span><span style="color: #3fdfd0;">)</span>;
    <span style="color: #ff62d4;">}</span>
    <span style="color: #6ae4b9;">Err</span><span style="color: #ff62d4;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">Error</span>::new<span style="color: #3fdfd0;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">ErrorKind</span>::<span style="color: #6ae4b9;">Other</span>, <span style="color: #79a8ff;">"error"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span>
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
