rust-for-rustaceans-6/index.org
** Everything in backticks is Rust code
- automatically run as doctests
- integration tests
  - no private fields or methods
  - ~test~ is not set on main
- each test gets its own ~fn main~
  - (can opt out of this)

** Must use the function you're testing    
- Can hide code with #  
- ~/// # use mylib::frobnify;~

** Results
#+begin_src rust
/// Here's an example that uses ? on multiple types
/// and thus needs to declare the concrete error type,
/// but we don't want to distract the user with that.
/// we also hide the use that brings the function into scope.
/// ```
/// # use mylib::frobnify;
/// # let unfrobnified_number = 0;
/// frobnify("0".parse()?)?;
/// # Ok::<(), anyhow::Error>(())
/// ```
#+end_src

** This example depends on ~anyhow~
- Cargo.toml
#+begin_src toml
[dev-dependencies]
anyhow = "1.0"
#+end_src

** Block comments
#+begin_src rust
/// You could even replace an entire block of code completely,
/// though use this _very_ sparingly.
/// ```
/// # use mylib::frobnify;
/// # /*
/// let i = ...;
/// # */
/// # let i = 42;
/// frobnify(0)?;
/// # Ok::<(), anyhow::Error>(())
/// ```
#+end_src

** Irony!
#+BEGIN_QUOTE
NOTE: Use this feature with care; it can be frustrating to users if they copy-paste an example and then it doesn't work because of required steps that you've hidden.
#+END_QUOTE

** Attributes
- ~should_panic~, ~ignore~, ~no_run~
- This code should fail to compile
#+begin_src rust
/// ```compile_fail
/// # struct MyNonSendType(std::rc::Rc<()>);
/// fn is_send<T: Send>() {}
/// is_send::<MyNonSendType>();
/// ```
#+end_src

* Additional Testing Tools
** Linting
- clippy
  - correctness lints
  - other lints
- rustc
  - warnings
  - (correctness lints are "errors")
  - ~rustc -W help~
** rustc warnings
  - Not all are on by default!
  - ~rust_2018_idioms~
  - ~missing_docs~
    - public, but no docstring
  - ~missing_debug_implementations~
    - public, but no ~Debug~
** Test Generation
- Fuzzing
- Property-Based Testing
  - [[https://proptest-rs.github.io/proptest/proptest/index.html][proptest]]
  - [[https://docs.rs/quickcheck/latest/quickcheck/][quickcheck]]

** [[https://www.cse.chalmers.se/~rjmh/QuickCheck/][QuickCheck]]
- originated in Haskell in 1999
- by [[https://www.cse.chalmers.se/~koen/][Koen Claessen]] and [[https://www.cse.chalmers.se/~rjmh/][John Hughes]]
- John Hughes [[https://www.youtube.com/results?search_query=john+hughes+quickcheck][talks on quickcheck]]
- shrinking
    
** Test Augmentation
- [[https://github.com/rust-lang/miri][Miri]]
  - mid-level intermediate representation (MIR)
- [[https://docs.rs/loom/latest/loom/][Loom]]
  - [[http://demsky.eecs.uci.edu/publications/c11modelcheck.pdf][CDSChecker]]: Checking Concurrent Data Structures Written with C/C++ Atomics

** Miri
- rustup +nightly component add miri
- cargo +nightly miri test
- cargo +nightly miri run

** Miri
#+begin_src rust
fn main() {
    let mut x = 42;
    let x: *mut i32 = &mut x;
    let (x1, x2) = unsafe { (&mut *x, &mut *x) };
    println!("{} {}", x1, x2);
}
#+end_src

** Miri
#+begin_src bash
❯ cargo +nightly run
   Compiling use-miri v0.1.0 (/home/tim/rust/use-miri)
    Finished `dev` profile [unoptimized + debuginfo] target(s) in 0.34s
     Running `/home/tim/rust/target/debug/use-miri`
42 42
#+end_src

