rust-for-rustaceans-6/index.html
<section id="slide-orgadf8d67">
<h3 id="orgadf8d67">Everything in backticks is Rust code</h3>
<ul>
<li>automatically run as doctests</li>
<li>integration tests
<ul>
<li>no private fields or methods</li>
<li><code>test</code> is not set on main</li>

</ul></li>
<li>each test gets its own <code>fn main</code>
<ul>
<li>(can opt out of this)</li>

</ul></li>

</ul>

</section>
<section id="slide-org468c3f3">
<h3 id="org468c3f3">Must use the function you're testing</h3>
<ul>
<li>Can hide code with #</li>
<li><code>/// # use mylib::frobnify;</code></li>

</ul>

</section>
<section id="slide-orgb03eafc">
<h3 id="orgb03eafc">Results</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b0d6f5;">/// Here's an example that uses ? on multiple types</span>
<span style="color: #b0d6f5;">/// and thus needs to declare the concrete error type,</span>
<span style="color: #b0d6f5;">/// but we don't want to distract the user with that.</span>
<span style="color: #b0d6f5;">/// we also hide the use that brings the function into scope.</span>
<span style="color: #b0d6f5;">/// ```</span>
<span style="color: #b0d6f5;">/// # use mylib::frobnify;</span>
<span style="color: #b0d6f5;">/// # let unfrobnified_number = 0;</span>
<span style="color: #b0d6f5;">/// frobnify("0".parse()?)?;</span>
<span style="color: #b0d6f5;">/// # Ok::&lt;(), anyhow::Error&gt;(())</span>
<span style="color: #b0d6f5;">/// ```</span>
</code></pre>
</div>

</section>
<section id="slide-org94a9da6">
<h3 id="org94a9da6">This example depends on <code>anyhow</code></h3>
<ul>
<li>Cargo.toml</li>

</ul>
<div class="org-src-container">

<pre  class="src src-toml"   ><code trim>[<span style="color: #6ae4b9;">dev-dependencies</span>]
<span style="color: #00d3d0;">anyhow</span> = <span style="color: #79a8ff;">"1.0"</span>
</code></pre>
</div>

</section>
<section id="slide-orgd97d449">
<h3 id="orgd97d449">Block comments</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b0d6f5;">/// You could even replace an entire block of code completely,</span>
<span style="color: #b0d6f5;">/// though use this _very_ sparingly.</span>
<span style="color: #b0d6f5;">/// ```</span>
<span style="color: #b0d6f5;">/// # use mylib::frobnify;</span>
<span style="color: #b0d6f5;">/// # /*</span>
<span style="color: #b0d6f5;">/// let i = ...;</span>
<span style="color: #b0d6f5;">/// # */</span>
<span style="color: #b0d6f5;">/// # let i = 42;</span>
<span style="color: #b0d6f5;">/// frobnify(0)?;</span>
<span style="color: #b0d6f5;">/// # Ok::&lt;(), anyhow::Error&gt;(())</span>
<span style="color: #b0d6f5;">/// ```</span>
</code></pre>
</div>

</section>
<section id="slide-orgcdb3cc0">
<h3 id="orgcdb3cc0">Irony!</h3>
<blockquote >
<p>
NOTE: Use this feature with care; it can be frustrating to users if they copy-paste an example and then it doesn't work because of required steps that you've hidden.
</p>
</blockquote>

</section>
<section id="slide-org6e9a313">
<h3 id="org6e9a313">Attributes</h3>
<ul>
<li><code>should_panic</code>, <code>ignore</code>, <code>no_run</code></li>
<li>This code should fail to compile</li>

</ul>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b0d6f5;">/// ```compile_fail</span>
<span style="color: #b0d6f5;">/// # struct MyNonSendType(std::rc::Rc&lt;()&gt;);</span>
<span style="color: #b0d6f5;">/// fn is_send&lt;T: Send&gt;() {}</span>
<span style="color: #b0d6f5;">/// is_send::&lt;MyNonSendType&gt;();</span>
<span style="color: #b0d6f5;">/// ```</span>
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org4c6f6f6">
<h2 id="org4c6f6f6">Additional Testing Tools</h2>
<div class="outline-text-2" id="text-org4c6f6f6">
</div>
</section>
<section id="slide-org0648bee">
<h3 id="org0648bee">Linting</h3>
<ul>
<li>clippy
<ul>
<li>correctness lints</li>
<li>other lints</li>

</ul></li>
<li>rustc
<ul>
<li>warnings</li>
<li>(correctness lints are "errors")</li>
<li><code>rustc -W help</code></li>

</ul></li>

</ul>
</section>
<section id="slide-orga40a24d">
<h3 id="orga40a24d">rustc warnings</h3>
<ul>
<li>Not all are on by default!</li>
<li><code>rust_2018_idioms</code></li>
<li><code>missing_docs</code>
<ul>
<li>public, but no docstring</li>

</ul></li>
<li><code>missing_debug_implementations</code>
<ul>
<li>public, but no <code>Debug</code></li>

</ul></li>

</ul>
</section>
<section id="slide-org43c59b3">
<h3 id="org43c59b3">Test Generation</h3>
<ul>
<li>Fuzzing</li>
<li>Property-Based Testing
<ul>
<li><a href="https://proptest-rs.github.io/proptest/proptest/index.html">proptest</a></li>
<li><a href="https://docs.rs/quickcheck/latest/quickcheck/">quickcheck</a></li>

</ul></li>

</ul>

</section>
<section id="slide-orgab45b9c">
<h3 id="orgab45b9c"><a href="https://www.cse.chalmers.se/~rjmh/QuickCheck/">QuickCheck</a></h3>
<ul>
<li>originated in Haskell in 1999</li>
<li>by <a href="https://www.cse.chalmers.se/~koen/">Koen Claessen</a> and <a href="https://www.cse.chalmers.se/~rjmh/">John Hughes</a></li>
<li>John Hughes <a href="https://www.youtube.com/results?search_query=john+hughes+quickcheck">talks on quickcheck</a></li>
<li>shrinking</li>

</ul>

</section>
<section id="slide-org71e1f16">
<h3 id="org71e1f16">Test Augmentation</h3>
<ul>
<li><a href="https://github.com/rust-lang/miri">Miri</a>
<ul>
<li>mid-level intermediate representation (MIR)</li>

</ul></li>
<li><a href="https://docs.rs/loom/latest/loom/">Loom</a>
<ul>
<li><a href="http://demsky.eecs.uci.edu/publications/c11modelcheck.pdf">CDSChecker</a>: Checking Concurrent Data Structures Written with C/C++ Atomics</li>

</ul></li>

</ul>

</section>
<section id="slide-orga5731c2">
<h3 id="orga5731c2">Miri</h3>
<ul>
<li>rustup +nightly component add miri</li>
<li>cargo +nightly miri test</li>
<li>cargo +nightly miri run</li>

</ul>

</section>
<section id="slide-org9ca03c9">
<h3 id="org9ca03c9">Miri</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">x</span> = 42;
    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">x</span>: *<span style="color: #b6a0ff;">mut</span> <span style="color: #6ae4b9;">i32</span> = <span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #b6a0ff;">mut</span> x;
    <span style="color: #b6a0ff;">let</span> <span style="color: #ff62d4;">(</span>x1, x2<span style="color: #ff62d4;">)</span> = <span style="color: #d0bc00;">unsafe</span> <span style="color: #ff62d4;">{</span> <span style="color: #3fdfd0;">(</span><span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #b6a0ff;">mut</span> *x, <span style="color: #ffffff; background-color: #000000;">&amp;</span><span style="color: #b6a0ff;">mut</span> *x<span style="color: #3fdfd0;">)</span> <span style="color: #ff62d4;">}</span>;
    <span style="color: #f78fe7;">println!</span><span style="color: #ff62d4;">(</span><span style="color: #79a8ff;">"</span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;"> </span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;">"</span>, x1, x2<span style="color: #ff62d4;">)</span>;
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orgbd50222">
<h3 id="orgbd50222">Miri</h3>
<div class="org-src-container">

<pre  class="src src-bash"   ><code trim>&#10095; cargo +nightly run
   Compiling use-miri v0.1.0 <span style="color: #ffffff;">(</span>/home/tim/rust/use-miri<span style="color: #ffffff;">)</span>
    Finished <span style="color: #f78fe7;">`dev`</span> profile <span style="color: #ffffff;">[</span>unoptimized + debuginfo<span style="color: #ffffff;">]</span> target<span style="color: #ffffff;">(</span>s<span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">in</span> 0.34s
     Running <span style="color: #f78fe7;">`/home/tim/rust/target/debug/use-miri`</span>
42 42
</code></pre>
</div>

</section>
