rust-for-rustaceans-6/index.org
** Miri
#+begin_src bash
❯ cargo +nightly miri run
Preparing a sysroot for Miri (target: x86_64-unknown-linux-gnu)... done
   Compiling use-miri v0.1.0 (/home/tim/rust/use-miri)
    Finished `dev` profile [unoptimized + debuginfo] target(s) in 0.03s
     Running `/home/tim/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/bin/cargo-miri runner /home/tim/rust/target/miri/x86_64-unknown-linux-gnu/debug/use-miri`
error: Undefined Behavior: trying to retag from <2377> for Unique permission at alloc1137[0x0], but that tag does not exist in the borrow stack for this location
 --> src/main.rs:4:29
  |
4 |     let (x1, x2) = unsafe { (&mut *x, &mut *x) };
  |                             ^^^^^^^^^^^^^^^^^^
  |                             |
  |                             trying to retag from <2377> for Unique permission at alloc1137[0x0], but that tag does not exist in the borrow stack for this location
  |                             this error occurs as part of retag (of a reference/box inside this compound value) at alloc1137[0x0..0x4]
  |                             errors for retagging in fields are fairly new; please reach out to us (e.g. at <https://rust-lang.zulipchat.com/#narrow/stream/269128-miri>) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: <2377> was created by a Unique retag at offsets [0x0..0x4]
 --> src/main.rs:4:30
  |
4 |     let (x1, x2) = unsafe { (&mut *x, &mut *x) };
  |                              ^^^^^^^
help: <2377> was later invalidated at offsets [0x0..0x4] by a Unique retag
 --> src/main.rs:4:39
  |
4 |     let (x1, x2) = unsafe { (&mut *x, &mut *x) };
  |                                       ^^^^^^^
  = note: BACKTRACE (of the first span):
  = note: inside `main` at src/main.rs:4:29: 4:47

note: some details are omitted, run with `MIRIFLAGS=-Zmiri-backtrace=full` for a verbose backtrace

error: aborting due to 1 previous error
#+end_src

** Performance Testing
- Performance Variance
- Compiler Optimizations
- I/O Overhead Measurement
    
** Performance Variance
  - [[https://docs.rs/hdrhistogram/latest/hdrhistogram/][hdrhistogram]] (high dynamic range histogram)
    - port of [[https://hdrhistogram.github.io/HdrHistogram/][HdrHistogram]] Java library
  - [[https://crates.io/crates/criterion][criterion]]
    - [[https://doc.rust-lang.org/cargo/commands/cargo-bench.html][cargo bench]]
    - ~$PROJECT/benches~

** Compiler Optimizations
  - [[https://godbolt.org/][godbolt.org]] ("Compiler Explorer")
  - +cargo-asm+ [[https://docs.rs/cargo-show-asm/latest/cargo_show_asm/][cargo-show-asm]]
    - command is still "cargo asm"
  - [[https://doc.rust-lang.org/std/hint/fn.black_box.html][~std::hint::black_box~]]
    - stabilized in [[https://github.com/rust-lang/rust/blob/stable/RELEASES.md#version-1660-2022-12-15][version 1.66]] (2022-12-15)

** cargo-show-asm
cargo install cargo-show-asm
 
** cargo-show-asm
#+begin_src rust
pub fn vec_push() {
    let mut vs = Vec::with_capacity(4);
    let start = std::time::Instant::now();
    for i in 0..4 {
        vs.push(i);
    }
    println!("took {:?}", start.elapsed());
}
#+end_src

