rust-for-rustaceans-6/index.html
<section id="slide-org7d85a0c">
<h3 id="org7d85a0c">Miri</h3>
<div class="org-src-container">

<pre  class="src src-bash"   ><code trim>&#10095; cargo +nightly miri run
Preparing a sysroot for Miri <span style="color: #ffffff;">(</span>target: x86_64-unknown-linux-gnu<span style="color: #ffffff;">)</span>... done
   Compiling use-miri v0.1.0 <span style="color: #ffffff;">(</span>/home/tim/rust/use-miri<span style="color: #ffffff;">)</span>
    Finished <span style="color: #f78fe7;">`dev`</span> profile <span style="color: #ffffff;">[</span>unoptimized + debuginfo<span style="color: #ffffff;">]</span> target<span style="color: #ffffff;">(</span>s<span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">in</span> 0.03s
     Running <span style="color: #f78fe7;">`/home/tim/.rustup/toolchains/nightly-x86_64-unknown-linux-gnu/bin/cargo-miri runner /home/tim/rust/target/miri/x86_64-unknown-linux-gnu/debug/use-miri`</span>
error: Undefined Behavior: trying to retag from &lt;2377&gt; for Unique permission at alloc1137<span style="color: #ffffff;">[</span>0x0<span style="color: #ffffff;">]</span>, but that tag does not exist<span style="color: #b6a0ff;"> in</span> the borrow stack for this location
 --&gt; src/main.rs:4:29
  |
4 |     <span style="color: #f78fe7;">let</span> <span style="color: #ffffff;">(</span>x1, x2<span style="color: #ffffff;">)</span> = unsafe <span style="color: #ffffff;">{</span> <span style="color: #ff62d4;">(</span>&amp;mut *x, &amp;mut *x<span style="color: #ff62d4;">)</span> <span style="color: #ffffff;">}</span>;
  |                             ^^^^^^^^^^^^^^^^^^
  |                             |
  |                             trying to retag from &lt;2377&gt; for Unique permission at alloc1137<span style="color: #ffffff;">[</span>0x0<span style="color: #ffffff;">]</span>, but that tag does not exist<span style="color: #b6a0ff;"> in</span> the borrow stack for this location
  |                             this error occurs as part of retag <span style="color: #ffffff;">(</span>of a reference/box inside this compound value<span style="color: #ffffff;">)</span> at alloc1137<span style="color: #ffffff;">[</span>0x0..0x4<span style="color: #ffffff;">]</span>
  |                             errors for retagging<span style="color: #b6a0ff;"> in</span> fields are fairly new; please reach out to us <span style="color: #ffffff;">(</span>e.g. at <a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">&lt;https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;</a><span style="color: #ffffff;"><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">)</a></span><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --"> </a><span style="color: #b6a0ff;"><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">if</a></span><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --"> you find this error troubling
  |
  = help: this indicates a potential bug</a><span style="color: #b6a0ff;"><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --"> in</a></span><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --"> the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
</a><span style="color: #f78fe7;"><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">help</a></span><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">: &lt;2377&gt; was created by a Unique retag at offsets </a><span style="color: #ffffff;"><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">[</a></span><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">0x0..0x4</a><span style="color: #ffffff;"><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">]</a></span><a href="https://rust-lang.zulipchat.com/#narrow/stream/269128-miri&gt;) if you find this error troubling
  |
  = help: this indicates a potential bug in the program: it performed an invalid operation, but the Stacked Borrows rules it violated are still experimental
  = help: see https://github.com/rust-lang/unsafe-code-guidelines/blob/master/wip/stacked-borrows.md for further information
help: &lt;2377&gt; was created by a Unique retag at offsets [0x0..0x4]
 --">
 --&gt;</a> src/main.rs:4:30
  |
4 |     <span style="color: #f78fe7;">let</span> <span style="color: #ffffff;">(</span>x1, x2<span style="color: #ffffff;">)</span> = unsafe <span style="color: #ffffff;">{</span> <span style="color: #ff62d4;">(</span>&amp;mut *x, &amp;mut *x<span style="color: #ff62d4;">)</span> <span style="color: #ffffff;">}</span>;
  |                              ^^^^^^^
<span style="color: #f78fe7;">help</span>: &lt;2377&gt; was later invalidated at offsets <span style="color: #ffffff;">[</span>0x0..0x4<span style="color: #ffffff;">]</span> by a Unique retag
 --&gt; src/main.rs:4:39
  |
4 |     <span style="color: #f78fe7;">let</span> <span style="color: #ffffff;">(</span>x1, x2<span style="color: #ffffff;">)</span> = unsafe <span style="color: #ffffff;">{</span> <span style="color: #ff62d4;">(</span>&amp;mut *x, &amp;mut *x<span style="color: #ff62d4;">)</span> <span style="color: #ffffff;">}</span>;
  |                                       ^^^^^^^
  = note: BACKTRACE <span style="color: #ffffff;">(</span>of the first span<span style="color: #ffffff;">)</span>:
  = note: inside <span style="color: #f78fe7;">`main`</span> at src/main.rs:4:29: 4:47

note: some details are omitted, run with <span style="color: #f78fe7;">`MIRIFLAGS=-Zmiri-backtrace=full`</span> <span style="color: #b6a0ff;">for</span> a verbose backtrace

error: aborting due to 1 previous error
</code></pre>
</div>

</section>
<section id="slide-org188ac08">
<h3 id="org188ac08">Performance Testing</h3>
<ul>
<li>Performance Variance</li>
<li>Compiler Optimizations</li>
<li>I/O Overhead Measurement</li>

</ul>

</section>
<section id="slide-orgeba3b08">
<h3 id="orgeba3b08">Performance Variance</h3>
<ul>
<li><a href="https://docs.rs/hdrhistogram/latest/hdrhistogram/">hdrhistogram</a> (high dynamic range histogram)
<ul>
<li>port of <a href="https://hdrhistogram.github.io/HdrHistogram/">HdrHistogram</a> Java library</li>

</ul></li>
<li><a href="https://crates.io/crates/criterion">criterion</a>
<ul>
<li><a href="https://doc.rust-lang.org/cargo/commands/cargo-bench.html">cargo bench</a></li>
<li><code>$PROJECT/benches</code></li>

</ul></li>

</ul>

</section>
<section id="slide-org472685a">
<h3 id="org472685a">Compiler Optimizations</h3>
<ul>
<li><a href="https://godbolt.org/">godbolt.org</a> ("Compiler Explorer")</li>
<li><del>cargo-asm</del> <a href="https://docs.rs/cargo-show-asm/latest/cargo_show_asm/">cargo-show-asm</a>
<ul>
<li>command is still "cargo asm"</li>

</ul></li>
<li><a href="https://doc.rust-lang.org/std/hint/fn.black_box.html"><code>std::hint::black_box</code></a>
<ul>
<li>stabilized in <a href="https://github.com/rust-lang/rust/blob/stable/RELEASES.md#version-1660-2022-12-15">version 1.66</a> (2022-12-15)</li>

</ul></li>

</ul>

</section>
<section id="slide-org5d8f116">
<h3 id="org5d8f116">cargo-show-asm</h3>
<p>
cargo install cargo-show-asm
</p>

</section>
