rust-for-rustaceans-6/index.org
** cargo-show-asm
~cargo asm vec_push~
#+begin_src asm
.section .text.mylib::vec_push,"ax",@progbits
	.globl	mylib::vec_push
	.p2align	4, 0x90
	.type	mylib::vec_push,@function
mylib::vec_push:
	.cfi_startproc
	sub rsp, 104
	.cfi_def_cfa_offset 112
	mov rax, qword ptr [rip + __rust_no_alloc_shim_is_unstable@GOTPCREL]
	movzx eax, byte ptr [rax]
	call qword ptr [rip + std::time::Instant::now@GOTPCREL]
	mov qword ptr [rsp + 8], rax
	mov dword ptr [rsp + 16], edx
	lea rdi, [rsp + 8]
	call qword ptr [rip + std::time::Instant::elapsed@GOTPCREL]
	mov qword ptr [rsp + 40], rax
	mov dword ptr [rsp + 48], edx
	lea rax, [rsp + 40]
	mov qword ptr [rsp + 24], rax
	mov rax, qword ptr [rip + <core::time::Duration as core::fmt::Debug>::fmt@GOTPCREL]
	mov qword ptr [rsp + 32], rax
	lea rax, [rip + .L__unnamed_1]
	mov qword ptr [rsp + 56], rax
	mov qword ptr [rsp + 64], 2
	mov qword ptr [rsp + 88], 0
	lea rax, [rsp + 24]
	mov qword ptr [rsp + 72], rax
	mov qword ptr [rsp + 80], 1
	lea rdi, [rsp + 56]
	call qword ptr [rip + std::io::stdio::_print@GOTPCREL]
	add rsp, 104
	.cfi_def_cfa_offset 8
	ret

======================= Additional context =========================

.section .rodata..L__unnamed_2,"a",@progbits
	.ascii	"took "
	.size	.L__unnamed_2, 5

.section .rodata..L__unnamed_3,"a",@progbits
	.byte	10
	.size	.L__unnamed_3, 1

.section .data.rel.ro..L__unnamed_1,"aw",@progbits
	.p2align	3, 0x0
	.quad	.L__unnamed_2
	.asciz	"\005\000\000\000\000\000\000"
	.quad	.L__unnamed_3
	.asciz	"\001\000\000\000\000\000\000"
	.size	.L__unnamed_1, 32
#+end_src

** ~black_box~
#+begin_src rust
use std::hint::black_box;
pub fn vec_push() {
    let mut vs = Vec::with_capacity(4);
    let start = std::time::Instant::now();
    for i in 0..4 {
        black_box(vs.as_ptr());
        vs.push(i);
        black_box(vs.as_ptr());
    }
    println!("took {:?}", start.elapsed());
}
#+end_src

