rust-for-rustaceans-6/index.html
<section id="slide-org40834ef">
<h3 id="org40834ef">cargo-show-asm</h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">vec_push</span><span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">vs</span> = <span style="color: #6ae4b9;">Vec</span>::with_capacity<span style="color: #ff62d4;">(</span>4<span style="color: #ff62d4;">)</span>;
    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">start</span> = <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">time</span>::<span style="color: #6ae4b9;">Instant</span>::now<span style="color: #ff62d4;">()</span>;
    <span style="color: #b6a0ff;">for</span> <span style="color: #00d3d0;">i</span> <span style="color: #b6a0ff;">in</span> 0..4 <span style="color: #ff62d4;">{</span>
        vs.push<span style="color: #3fdfd0;">(</span>i<span style="color: #3fdfd0;">)</span>;
    <span style="color: #ff62d4;">}</span>
    <span style="color: #f78fe7;">println!</span><span style="color: #ff62d4;">(</span><span style="color: #79a8ff;">"took </span><span style="color: #79a8ff; font-style: italic;">{:?}</span><span style="color: #79a8ff;">"</span>, start.elapsed<span style="color: #3fdfd0;">()</span><span style="color: #ff62d4;">)</span>;
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org64daef9">
<h3 id="org64daef9">cargo-show-asm</h3>
<p>
<code>cargo asm vec_push</code>
</p>
<div class="org-src-container">

<pre  class="src src-asm"   ><code trim><span style="color: #b6a0ff;">.section</span> .text.mylib::vec_push,<span style="color: #79a8ff;">"ax"</span>,@progbits
        <span style="color: #b6a0ff;">.globl</span>  mylib::vec_push
        <span style="color: #b6a0ff;">.p2align</span>        4, 0x90
        <span style="color: #b6a0ff;">.type</span>   mylib::vec_push,@function
<span style="color: #feacd0;">mylib</span>::vec_push:
        <span style="color: #b6a0ff;">.cfi_startproc</span>
        <span style="color: #b6a0ff;">sub</span> rsp, 104
        <span style="color: #b6a0ff;">.cfi_def_cfa_offset</span> 112
        <span style="color: #b6a0ff;">mov</span> rax, qword ptr <span style="color: #ffffff;">[</span>rip + __rust_no_alloc_shim_is_unstable@GOTPCREL<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">movzx</span> eax, byte ptr <span style="color: #ffffff;">[</span>rax<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">call</span> qword ptr <span style="color: #ffffff;">[</span>rip + std::time::Instant::now@GOTPCREL<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 8<span style="color: #ffffff;">]</span>, rax
        <span style="color: #b6a0ff;">mov</span> dword ptr <span style="color: #ffffff;">[</span>rsp + 16<span style="color: #ffffff;">]</span>, edx
        <span style="color: #b6a0ff;">lea</span> rdi, <span style="color: #ffffff;">[</span>rsp + 8<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">call</span> qword ptr <span style="color: #ffffff;">[</span>rip + std::time::Instant::elapsed@GOTPCREL<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 40<span style="color: #ffffff;">]</span>, rax
        <span style="color: #b6a0ff;">mov</span> dword ptr <span style="color: #ffffff;">[</span>rsp + 48<span style="color: #ffffff;">]</span>, edx
        <span style="color: #b6a0ff;">lea</span> rax, <span style="color: #ffffff;">[</span>rsp + 40<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 24<span style="color: #ffffff;">]</span>, rax
        <span style="color: #b6a0ff;">mov</span> rax, qword ptr <span style="color: #ffffff;">[</span>rip + &lt;core::time::Duration as core::fmt::Debug&gt;::fmt@GOTPCREL<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 32<span style="color: #ffffff;">]</span>, rax
        <span style="color: #b6a0ff;">lea</span> rax, <span style="color: #ffffff;">[</span>rip + .L__unnamed_1<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 56<span style="color: #ffffff;">]</span>, rax
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 64<span style="color: #ffffff;">]</span>, 2
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 88<span style="color: #ffffff;">]</span>, 0
        <span style="color: #b6a0ff;">lea</span> rax, <span style="color: #ffffff;">[</span>rsp + 24<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 72<span style="color: #ffffff;">]</span>, rax
        <span style="color: #b6a0ff;">mov</span> qword ptr <span style="color: #ffffff;">[</span>rsp + 80<span style="color: #ffffff;">]</span>, 1
        <span style="color: #b6a0ff;">lea</span> rdi, <span style="color: #ffffff;">[</span>rsp + 56<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">call</span> qword ptr <span style="color: #ffffff;">[</span>rip + std::io::stdio::_print@GOTPCREL<span style="color: #ffffff;">]</span>
        <span style="color: #b6a0ff;">add</span> rsp, 104
        <span style="color: #b6a0ff;">.cfi_def_cfa_offset</span> 8
        <span style="color: #b6a0ff;">ret</span>

======================= Additional context =========================

<span style="color: #b6a0ff;">.section</span> .rodata..L__unnamed_2,<span style="color: #79a8ff;">"a"</span>,@progbits
        <span style="color: #b6a0ff;">.ascii</span>  <span style="color: #79a8ff;">"took "</span>
        <span style="color: #b6a0ff;">.size</span>   .L__unnamed_2, 5

<span style="color: #b6a0ff;">.section</span> .rodata..L__unnamed_3,<span style="color: #79a8ff;">"a"</span>,@progbits
        <span style="color: #b6a0ff;">.byte</span>   10
        <span style="color: #b6a0ff;">.size</span>   .L__unnamed_3, 1

<span style="color: #b6a0ff;">.section</span> .data.rel.ro..L__unnamed_1,<span style="color: #79a8ff;">"aw"</span>,@progbits
        <span style="color: #b6a0ff;">.p2align</span>        3, 0x0
        <span style="color: #b6a0ff;">.quad</span>   .L__unnamed_2
        <span style="color: #b6a0ff;">.asciz</span>  <span style="color: #79a8ff;">"\005\000\000\000\000\000\000"</span>
        <span style="color: #b6a0ff;">.quad</span>   .L__unnamed_3
        <span style="color: #b6a0ff;">.asciz</span>  <span style="color: #79a8ff;">"\001\000\000\000\000\000\000"</span>
        <span style="color: #b6a0ff;">.size</span>   .L__unnamed_1, 32
</code></pre>
</div>

</section>
<section id="slide-org9456508">
<h3 id="org9456508"><code>black_box</code></h3>
<div class="org-src-container">

<pre  class="src src-rust"   ><code trim><span style="color: #b6a0ff;">use</span> <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">hint</span>::black_box;
<span style="color: #b6a0ff;">pub</span> <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">vec_push</span><span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">vs</span> = <span style="color: #6ae4b9;">Vec</span>::with_capacity<span style="color: #ff62d4;">(</span>4<span style="color: #ff62d4;">)</span>;
    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">start</span> = <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">time</span>::<span style="color: #6ae4b9;">Instant</span>::now<span style="color: #ff62d4;">()</span>;
    <span style="color: #b6a0ff;">for</span> <span style="color: #00d3d0;">i</span> <span style="color: #b6a0ff;">in</span> 0..4 <span style="color: #ff62d4;">{</span>
        black_box<span style="color: #3fdfd0;">(</span>vs.as_ptr<span style="color: #fba849;">()</span><span style="color: #3fdfd0;">)</span>;
        vs.push<span style="color: #3fdfd0;">(</span>i<span style="color: #3fdfd0;">)</span>;
        black_box<span style="color: #3fdfd0;">(</span>vs.as_ptr<span style="color: #fba849;">()</span><span style="color: #3fdfd0;">)</span>;
    <span style="color: #ff62d4;">}</span>
    <span style="color: #f78fe7;">println!</span><span style="color: #ff62d4;">(</span><span style="color: #79a8ff;">"took </span><span style="color: #79a8ff; font-style: italic;">{:?}</span><span style="color: #79a8ff;">"</span>, start.elapsed<span style="color: #3fdfd0;">()</span><span style="color: #ff62d4;">)</span>;
<span style="color: #ffffff;">}</span>
</code></pre>
</div>

</section>
